In [1]:
import pandas as pd

In [2]:
dict1={"name":['priya','ammu','anu','ramya'],
      "Age":[32,56,37,69],
      "salary":[2000,34000,56000,57544],
      "class":["asd",'dfh','ghf','iuj']}

In [3]:
df1=pd.DataFrame(dict1)

In [4]:
df1

    name  Age  salary class
0  priya   32    2000   asd
1   ammu   56   34000   dfh
2    anu   37   56000   ghf
3  ramya   69   57544   iuj

In [5]:
dict2={"name":['priya1','ammu1','roja1','ramya1'],
      "Age":[32,56,37,69],
      "salary":[2000,34000,56000,57544],
      "class":["asd1",'dfh1','ghf1','iuj1']}

In [6]:
df2=pd.DataFrame(dict2)

In [7]:
df2

     name  Age  salary class
0  priya1   32    2000  asd1
1   ammu1   56   34000  dfh1
2   roja1   37   56000  ghf1
3  ramya1   69   57544  iuj1

In [8]:
pd.concat([df1,df2])

     name  Age  salary class
0   priya   32    2000   asd
1    ammu   56   34000   dfh
2     anu   37   56000   ghf
3   ramya   69   57544   iuj
0  priya1   32    2000  asd1
1   ammu1   56   34000  dfh1
2   roja1   37   56000  ghf1
3  ramya1   69   57544  iuj1

In [9]:
pd.concat([df1,df2],axis=1)

    name  Age  salary class    name  Age  salary class
0  priya   32    2000   asd  priya1   32    2000  asd1
1   ammu   56   34000   dfh   ammu1   56   34000  dfh1
2    anu   37   56000   ghf   roja1   37   56000  ghf1
3  ramya   69   57544   iuj  ramya1   69   57544  iuj1

In [10]:
dict3={"name1":['priya1','ammu1','roja1','ramya1'],
      "Age1":[32,56,37,69],
      "salary1":[2000,34000,56000,57544],
      "class1":["asd1",'dfh1','ghf1','iuj1']}

In [11]:
df3=pd.DataFrame(dict3)

In [12]:
df3

    name1  Age1  salary1 class1
0  priya1    32     2000   asd1
1   ammu1    56    34000   dfh1
2   roja1    37    56000   ghf1
3  ramya1    69    57544   iuj1

In [13]:
pd.concat([df1,df3])

    name   Age   salary class   name1  Age1  salary1 class1
0  priya  32.0   2000.0   asd     NaN   NaN      NaN    NaN
1   ammu  56.0  34000.0   dfh     NaN   NaN      NaN    NaN
2    anu  37.0  56000.0   ghf     NaN   NaN      NaN    NaN
3  ramya  69.0  57544.0   iuj     NaN   NaN      NaN    NaN
0    NaN   NaN      NaN   NaN  priya1  32.0   2000.0   asd1
1    NaN   NaN      NaN   NaN   ammu1  56.0  34000.0   dfh1
2    NaN   NaN      NaN   NaN   roja1  37.0  56000.0   ghf1
3    NaN   NaN      NaN   NaN  ramya1  69.0  57544.0   iuj1

In [14]:
df4=pd.concat([df1,df3],axis=1)

In [15]:
df4

    name  Age  salary class   name1  Age1  salary1 class1
0  priya   32    2000   asd  priya1    32     2000   asd1
1   ammu   56   34000   dfh   ammu1    56    34000   dfh1
2    anu   37   56000   ghf   roja1    37    56000   ghf1
3  ramya   69   57544   iuj  ramya1    69    57544   iuj1

In [16]:
df4.iloc[1:3]

   name  Age  salary class  name1  Age1  salary1 class1
1  ammu   56   34000   dfh  ammu1    56    34000   dfh1
2   anu   37   56000   ghf  roja1    37    56000   ghf1

In [17]:
df4.iloc[1:3,1:3]

   Age  salary
1   56   34000
2   37   56000

In [22]:
df4.iloc[1:4:2]

    name  Age  salary class   name1  Age1  salary1 class1
1   ammu   56   34000   dfh   ammu1    56    34000   dfh1
3  ramya   69   57544   iuj  ramya1    69    57544   iuj1

In [32]:
df4.iloc[[1,3],5:]

   Age1  salary1 class1
1    56    34000   dfh1
3    69    57544   iuj1

In [42]:
df4.iloc[[1,0,3],[5,7,6,4]]

   Age1 class1  salary1   name1
1    56   dfh1    34000   ammu1
0    32   asd1     2000  priya1
3    69   iuj1    57544  ramya1

In [48]:
df4.iloc[[1,3]][['name1','Age1']]

    name1  Age1
1   ammu1    56
3  ramya1    69

In [56]:
dict1={"name":['priya','ammu1','roja','ramya1'],
      "Age":[32,56,37,69],
      "salary":[2000,34000,56000,57544],
      "class":["asd1",'dfh1','ghf1','iuj1']}

In [50]:
dict2={"name":['priya1','ammu1','roja1','ramya1'],
      "Age":[32,56,37,69],
      "salary":[2000,34000,56000,57544],
      "class":["asd",'dfh1','ghf1','iuj']}

In [57]:
df1=pd.DataFrame(dict1)

In [52]:
df2=pd.DataFrame(dict2)

In [58]:
df1

     name  Age  salary class
0   priya   32    2000  asd1
1   ammu1   56   34000  dfh1
2    roja   37   56000  ghf1
3  ramya1   69   57544  iuj1

In [54]:
df2

     name  Age  salary class
0  priya1   32    2000   asd
1   ammu1   56   34000  dfh1
2   roja1   37   56000  ghf1
3  ramya1   69   57544   iuj

In [59]:
pd.merge(df1,df2)

    name  Age  salary class
0  ammu1   56   34000  dfh1

In [60]:
pd.merge(df1,df2,on='name')

     name  Age_x  salary_x class_x  Age_y  salary_y class_y
0   ammu1     56     34000    dfh1     56     34000    dfh1
1  ramya1     69     57544    iuj1     69     57544     iuj

In [61]:
pd.merge(df1,df2, on="class",how="right")

  name_x  Age_x  salary_x class  name_y  Age_y  salary_y
0  ammu1   56.0   34000.0  dfh1   ammu1     56     34000
1   roja   37.0   56000.0  ghf1   roja1     37     56000
2    NaN    NaN       NaN   asd  priya1     32      2000
3    NaN    NaN       NaN   iuj  ramya1     69     57544

In [64]:
pd.merge(df1,df2, on ="class", how="left")

   name_x  Age_x  salary_x class name_y  Age_y  salary_y
0   priya     32      2000  asd1    NaN    NaN       NaN
1   ammu1     56     34000  dfh1  ammu1   56.0   34000.0
2    roja     37     56000  ghf1  roja1   37.0   56000.0
3  ramya1     69     57544  iuj1    NaN    NaN       NaN

In [73]:
dict3={"name1":['priya1','ammu1','roja1','ramya1'],
      "Age1":[32,56,37,69],
      "salary1":[2000,34000,56000,57544],
      "class1":["asd2",'dfh1','ghf2','iuj1']}

In [74]:
df3=pd.DataFrame(dict3)

In [75]:
df3

    name1  Age1  salary1 class1
0  priya1    32     2000   asd2
1   ammu1    56    34000   dfh1
2   roja1    37    56000   ghf2
3  ramya1    69    57544   iuj1

In [79]:
pd.merge(df1,df3, left_on="class", right_on="class1", how="left")

     name  Age  salary class   name1  Age1  salary1 class1
0   priya   32    2000  asd1     NaN   NaN      NaN    NaN
1   ammu1   56   34000  dfh1   ammu1  56.0  34000.0   dfh1
2    roja   37   56000  ghf1     NaN   NaN      NaN    NaN
3  ramya1   69   57544  iuj1  ramya1  69.0  57544.0   iuj1

In [82]:
pd.merge(df1,df2, how="left" , on =["class", "name"])

     name  Age_x  salary_x class  Age_y  salary_y
0   priya     32      2000  asd1    NaN       NaN
1   ammu1     56     34000  dfh1   56.0   34000.0
2    roja     37     56000  ghf1    NaN       NaN
3  ramya1     69     57544  iuj1    NaN       NaN

In [83]:
df1

     name  Age  salary class
0   priya   32    2000  asd1
1   ammu1   56   34000  dfh1
2    roja   37   56000  ghf1
3  ramya1   69   57544  iuj1

In [86]:
df3

    name1  Age1  salary1 class1
0  priya1    32     2000   asd2
1   ammu1    56    34000   dfh1
2   roja1    37    56000   ghf2
3  ramya1    69    57544   iuj1

In [88]:
df1.join(df3, how="outer")

     name  Age  salary class   name1  Age1  salary1 class1
0   priya   32    2000  asd1  priya1    32     2000   asd2
1   ammu1   56   34000  dfh1   ammu1    56    34000   dfh1
2    roja   37   56000  ghf1   roja1    37    56000   ghf2
3  ramya1   69   57544  iuj1  ramya1    69    57544   iuj1

In [89]:
df1.join(df3, how="left")

     name  Age  salary class   name1  Age1  salary1 class1
0   priya   32    2000  asd1  priya1    32     2000   asd2
1   ammu1   56   34000  dfh1   ammu1    56    34000   dfh1
2    roja   37   56000  ghf1   roja1    37    56000   ghf2
3  ramya1   69   57544  iuj1  ramya1    69    57544   iuj1

In [93]:
df3

    name1  Age1  salary1 class1
0  priya1    32     2000   asd2
1   ammu1    56    34000   dfh1
2   roja1    37    56000   ghf2
3  ramya1    69    57544   iuj1

In [94]:
dict4={"name1":['priya1','ammu1','roja1','ramya1'],
      "Age1":[32,56,37,69],
      "salary1":[2000,34000,56000,57544],
      "class1":["asd4",'dfh4','ghf2','iuj']}

In [95]:
df4=pd.DataFrame(dict4, index=[4,5,6,7])

In [96]:
df4

    name1  Age1  salary1 class1
4  priya1    32     2000   asd4
5   ammu1    56    34000   dfh4
6   roja1    37    56000   ghf2
7  ramya1    69    57544    iuj

In [101]:
df1.join(df4, how="outer")

     name   Age   salary class   name1  Age1  salary1 class1
0   priya  32.0   2000.0  asd1     NaN   NaN      NaN    NaN
1   ammu1  56.0  34000.0  dfh1     NaN   NaN      NaN    NaN
2    roja  37.0  56000.0  ghf1     NaN   NaN      NaN    NaN
3  ramya1  69.0  57544.0  iuj1     NaN   NaN      NaN    NaN
4     NaN   NaN      NaN   NaN  priya1  32.0   2000.0   asd4
5     NaN   NaN      NaN   NaN   ammu1  56.0  34000.0   dfh4
6     NaN   NaN      NaN   NaN   roja1  37.0  56000.0   ghf2
7     NaN   NaN      NaN   NaN  ramya1  69.0  57544.0    iuj

In [102]:
df1.join(df4, how="left")

     name  Age  salary class name1  Age1  salary1 class1
0   priya   32    2000  asd1   NaN   NaN      NaN    NaN
1   ammu1   56   34000  dfh1   NaN   NaN      NaN    NaN
2    roja   37   56000  ghf1   NaN   NaN      NaN    NaN
3  ramya1   69   57544  iuj1   NaN   NaN      NaN    NaN

In [103]:
df1.join(df4, how="right")

  name  Age  salary class   name1  Age1  salary1 class1
4  NaN  NaN     NaN   NaN  priya1    32     2000   asd4
5  NaN  NaN     NaN   NaN   ammu1    56    34000   dfh4
6  NaN  NaN     NaN   NaN   roja1    37    56000   ghf2
7  NaN  NaN     NaN   NaN  ramya1    69    57544    iuj

In [104]:
df1.join(df4, how="inner")

Empty DataFrame
Columns: [name, Age, salary, class, name1, Age1, salary1, class1]
Index: []

In [4]:
l=[1,2,3,4,5,6]
[i+1 for i in l]

[2, 3, 4, 5, 6, 7]

## MAP function

In [5]:
def test(data):
    return data+1

In [6]:
map(test,l)

In [7]:
list(map(test,l))

[2, 3, 4, 5, 6, 7]

In [8]:
def t1(data):
    if data <3:
        return np.sqrt(data)
    else: 
        return np.log(data)

In [9]:
list(map(t1,l))

[1.0,
 1.4142135623730951,
 1.0986122886681098,
 1.3862943611198906,
 1.6094379124341003,
 1.791759469228055]

### lamda - anonymous  function

In [10]:
list (map(lambda data:data+1,l))

[2, 3, 4, 5, 6, 7]

In [11]:
l2=[10,10,10,10,10,10]

In [14]:
list(map(lambda x,y:x+y , l,l2))

[11, 12, 13, 14, 15, 16]

In [15]:
def t2(x,y):
    return x+y

In [16]:
list(map(t2,l,l2))

[11, 12, 13, 14, 15, 16]

In [20]:
list(map(lambda x:np.sqrt(x) if x<3 else np.log(x),l))

[1.0,
 1.4142135623730951,
 1.0986122886681098,
 1.3862943611198906,
 1.6094379124341003,
 1.791759469228055]

## Reduce Function

In [36]:
l1=[1,2,3,4,5]
l1[2]

3

In [39]:
add=0
for i in l1:
   # print(i)
    add=i+add
    #print("add",add)
    i=i+1
print(add)

15

In [40]:
sum(l1)

15

In [41]:
import functools

In [42]:
def test1(x,y):
    return x+y

In [61]:
functools.reduce(test1,l1)

15

In [45]:
functools.reduce(lambda x,y:x+y,l1)

15

In [56]:
def red(data):
    max=0
    for i in data:
        if i>max:
            max=i
    print(max)

In [57]:
red([11, 12, 13, 14, 15, 16])

16

In [60]:
functools.reduce(red,l1) ### not working because red function is taking only one parameter

TypeError: red() takes 1 positional argument but 2 were given

In [59]:
functools.reduce(lambda x,y: x if x>y else y, l1)

5

### Filter Function

In [91]:
l3=[1,2,2,3,4,5,6,23,566,331,456,67,8,24,567,45]

In [67]:
[i for  i in l3 if i%2==0]

[2, 2, 4, 6, 566, 456, 8, 24]

In [98]:
def test(data):
    if data % 2==0:
        return True
    else:
        return False
## filter

In [99]:
list(filter(test,l3))

[2, 2, 4, 6, 566, 456, 8, 24]

In [94]:
list(filter(lambda data: True if data%2==0 else False ,l3))

[2, 2, 4, 6, 566, 456, 8, 24]